note/note-linux-awk.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-01-24 Thu 21:14 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>AWK 程序设计语言</title>
<meta name="generator" content="Org mode">
<meta name="author" content="manue1">
<link rel="stylesheet" type="text/css" href="css/worg.css" />
<!-- <link rel="shortcut icon" href="http://www.langdebuqing.com/images/favicon.ico" type="image/x-icon" /> -->
</head>
<body>
<div id="preamble" class="status">
<div id="navbar">
    <ul>
        <li id="site-master"><a href="https://www.manue1.site/">Manue1's Journal</a></li>
        <li><a class="navbar-item" href="https://www.manue1.site/write.html">All Posts</a> </li>
        <li><a class="navbar-item" href="https://www.manue1.site/link.html">Links</a> </li>
        <li class="search">
            <form action="http://google.com/search" method="get" accept-charset="utf-8">
                <input type="search" id="search" name="q" autocomplete="off" maxlength="30" placeholder="Search..">
                <input type="hidden" name="q" value="site:www.manue1.com">
            </form>
        </li>
    </ul>
</div>
</div>
<div id="content">
<h1 class="title">AWK 程序设计语言</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge2cba41">1. awk 基本语法</a>
<ul>
<li><a href="#orgd158cd6">1.1. pattern</a></li>
<li><a href="#org88689b8">1.2. action</a></li>
</ul>
</li>
<li><a href="#orgeda585e">2. awk 常用命令</a></li>
</ul>
</div>
</div>
<p>
使用awk的目的是为了方便解决: 计数、数据格式转换、计算、以及从报表中提取数据.<br>
这本<a href="https://github.com/wuzhouhui/awk">AWK 程序设计语言</a> 几百页的书，很好的诠释了这门工具语言的强大，书中最后附录<br>
A总结了很多awk的使用注意事项,有兴趣的可以关注一下.这里只是记录一下工作中用到<br>
的一些使用awk提高工作效率的场景<br>
</p>

<div id="outline-container-orge2cba41" class="outline-2">
<h2 id="orge2cba41"><span class="section-number-2">1</span> awk 基本语法</h2>
<div class="outline-text-2" id="text-1">
<p>
最简单的awk 程序是一个或多个模式–动作语句构成的序列:<br>
</p>

<p>
<code>pattern { action }</code><br>
</p>

<p>
<code>pattern { action }</code><br>
</p>

<p>
简单的单行awk语句可以直接执行<br>
</p>

<p>
<code>awk pattern {action} filename</code><br>
</p>

<p>
如果复杂点的awk语句,可以写入文件内,<br>
</p>

<p>
<code>awk -f awk.sh awk_txt</code><br>
</p>
</div>
<div id="outline-container-orgd158cd6" class="outline-3">
<h3 id="orgd158cd6"><span class="section-number-3">1.1</span> pattern</h3>
<div class="outline-text-3" id="text-1-1">
<p>
模式汇总<br>
</p>
<ol class="org-ol">
<li><p>
BEGIN{ statements}<br>
</p>

<p>
在输入被读取之前, statements 执行一次.<br>
</p></li>
<li><p>
END{ statements}<br>
</p>

<p>
当所有输入被读取完毕之后, statements 执行一次.<br>
</p></li>
<li><p>
expression{ statements}<br>
</p>

<p>
每碰到一个使expression 为真的输入行, statements 就执行<br>
expression 为真指的是其值非零或非空.<br>
</p></li>
<li><p>
regular expression { statements}<br>
</p>

<p>
当碰到这样一个输入行时, statements 就执行: 输入行含有一段字符串,<br>
而该字符串可以被regular expression 匹配.<br>
</p></li>
<li><p>
compound pattern { statements}<br>
</p>

<p>
一个复合模式将表达式用&amp;&amp;(AND), ||(OR), !(NOT), 以及括号组合起来;<br>
当compound pattern为真时, statements 执行.<br>
</p></li>
<li><p>
pattern1, pattern2 { statements}<br>
</p>

<p>
一个范围模式匹配多个输入行, 这些输入行从匹配pattern1 的行开始,<br>
到匹配pattern2 的行结束(包括这两行), 对这其中的每一行执行statements<br>
BEGIN 与END 不与其他模式组合. 一个范围模式不能是其他模式的一部分.<br>
BEGIN 与END 是唯一两个不能省略动作的模式.<br>
</p></li>
</ol>
</div>
</div>
<div id="outline-container-org88689b8" class="outline-3">
<h3 id="org88689b8"><span class="section-number-3">1.2</span> action</h3>
<div class="outline-text-3" id="text-1-2">
<p>
动作中的语句可以包括:<br>
</p>
<pre class="example">
expression, 包括常量, 变量, 赋值, 函数调用等等.
print expression-list
printf(format, expression-list)
if (expression) statements
if (expression) statements else statements
while (expression) statements
for (expression; expression; expression) statements
for (expression in array) statements
do statements while (expression)
break
continue
</pre>
<p>
awk作为一种编程语言,刚开始接触awk语句看得眼晕主要是不了解它的内置变量<br>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">变量</th>
<th scope="col" class="org-left">意义</th>
<th scope="col" class="org-left">默认值</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">ARGC</td>
<td class="org-left">命令行参数的个数</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">ARGV</td>
<td class="org-left">命令行参数数组</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">FILENAME</td>
<td class="org-left">当前输入文件名</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">FNR</td>
<td class="org-left">当前输入文件的记录个数</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">FS</td>
<td class="org-left">控制着输入行的字段分割符</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">NF</td>
<td class="org-left">当前记录的字段个数</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">NR</td>
<td class="org-left">到目前为止读的记录数量</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">OFMT</td>
<td class="org-left">数值的输出格式</td>
<td class="org-left">%.6g</td>
</tr>

<tr>
<td class="org-left">OFS</td>
<td class="org-left">输出字段分割符</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ORS</td>
<td class="org-left">输出的记录的分割符</td>
<td class="org-left">\n</td>
</tr>

<tr>
<td class="org-left">RLENGTH</td>
<td class="org-left">被函数match匹配的字符串的长度</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">RS</td>
<td class="org-left">控制着输入行的记录分割符"\n"</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">RSTART</td>
<td class="org-left">被函数match匹配的字符串的开始</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">SUBSEP</td>
<td class="org-left">下标分割符</td>
<td class="org-left">\034</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgeda585e" class="outline-2">
<h2 id="orgeda585e"><span class="section-number-2">2</span> awk 常用命令</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><p>
kill 进程<br>
</p>

<p>
<code>ps aux|grep test.py|awk '{print $2}'|xargs kill -9</code><br>
</p></li>

<li><p>
两文件比较 取相同部分<br>
</p>

<p>
<code>awk -F ':' 'NR==FNR{a[$1]++}NR!=FNR{if($1 in a){print $i}}' 1.txt 2.txt &gt;3.txt</code><br>
</p>

<p>
输出2.txt在1.txt中第一列相同的所有值<br>
</p></li>

<li><p>
输出3文件内 大于10列<br>
</p>

<p>
awk 'NF&gt;10 {print $i}' 3.txt &gt; 4.txt<br>
</p></li>

<li><p>
删除重复行<br>
</p>

<p>
<code>awk '!($0 in array) { array[$0]; print}' temp</code></p></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>
    <a href="">manue1</a> 搭建和维护，使用
    <a href="https://www.gnu.org/software/emacs/">Emacs</a>
    <a href="http://orgmode.org/">Org mode</a> 编辑和构建
</p>
<script src="http://www.langdebuqing.com/css/jquery-2.1.3.min.js"></script>
<script src="http://www.langdebuqing.com/css/main.js"></script>
</div>
</body>
</html>